# 백준 거스름돈
n = int(input())
cnt = 0
i = 0

while True:
    if n % 5 == 0:
        cnt += n//5
        break
    else:
        n -= 2
        cnt += 1

        if n < 0:
            break

if n < 0:
    print(-1)
else:
    print(cnt)
    

# dp 사용
# 원 : 갯수
# 1 : -1
# 2 : 1(2원)
# 3 : -1
# 4 : 2(2원)
# -------------------
# 5 : 1(5원) / 0(2원)
# 6 : 0(5원) / 3(2원)
# 7 : 1(5원) / 1(2원)
# 8 : 0(5원) / 4(2원)
# 9 : 1(5원) / 2(2원)
# -------------------
# 10 : 2(5원) / 0(2원)
# 11 : 1(5원) / 3(2원)
# 12 : 2(5원) / 1(2원)
# 13 : 1(5원) / 4(2원)
# 14 : 2(5원) / 2(2원)

# 2원 패턴 0 -> 3 -> 1 -> 4 -> 2
# 5원 패턴 1 -> 0 -> 1 -> 0 -> 1 <= 패턴이 넘어갈 때마다 1씩 증가

# n = int(input())
# dp = [-1, -1, 1, -1, 2, 1, 3, 2, 4, 3]

# for i in range(10, n+1):
#     dp.append(dp[i-5]+1)
# print(dp[n])